src/Openfoam/AeroSUVNDF/system/blockMeshDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1.0;

vertices (
    (-23.933048 -6.14298 -0.0239946)
    (50.00311 -6.14298 -0.0239946)
    (50.00311 6.14298 -0.0239946)
    (-23.933048 6.14298 -0.0239946)
    (-23.933048 -6.14298 5.6015015)
    (50.00311 -6.14298 5.6015015)
    (50.00311 6.14298 5.6015015)
    (-23.933048 6.14298 5.6015015)
);

blocks (
    hex (0 1 2 3 4 5 6 7) (493 82 38) simpleGrading (1 1 1)
);

edges ();

boundary (
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottom { type wall; faces ((0 1 2 3)); }
    top    { type symmetryPlane; faces ((4 7 6 5)); }
    front  { type symmetryPlane; faces ((0 4 5 1)); }
    back   { type symmetryPlane; faces ((3 2 6 7)); }
);

mergePatchPairs ();
